БПКР/src/Documents/ОперацияБух/ОперацияБух.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОперацияБух</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.СчетаФактурыВыписанные</registerRecords>
  <registerRecords>AccumulationRegister.УбыткиПрошлыхЛет</registerRecords>
  <registerRecords>AccumulationRegister.НезавершенноеПроизводство</registerRecords>
  <registerRecords>AccumulationRegister.ВозвратДенежныхСредствПодотчетником</registerRecords>
  <registerRecords>AccumulationRegister.ОборотыПоДаннымЕдиногоНалога</registerRecords>
  <registerRecords>InformationRegister.МестонахождениеОС</registerRecords>
  <registerRecords>InformationRegister.СведенияОбИмуществе</registerRecords>
  <registerRecords>AccumulationRegister.ДвижениеОСНУ</registerRecords>
  <registerRecords>AccumulationRegister.ОборотыГТД</registerRecords>
  <registerRecords>AccumulationRegister.РеестрЗакупок</registerRecords>
  <registerRecords>InformationRegister.СтажиСотрудников</registerRecords>
  <registerRecords>AccumulationRegister.РеестрВвезенныхМатериальныхРесурсов</registerRecords>
  <registerRecords>AccumulationRegister.ДанныеДляОтчетаПоСФЕжемесячному</registerRecords>
  <registerRecords>InformationRegister.СотрудникиПоТрудовымСоглашениям</registerRecords>
  <registerRecords>InformationRegister.АвансыПодотчетника</registerRecords>
  <registerRecords>AccumulationRegister.ПродажиОсновныхСредств</registerRecords>
  <registerRecords>AccumulationRegister.ДанныеЗакупочныхАктов</registerRecords>
  <registerRecords>AccumulationRegister.БланкиСчетовФактур</registerRecords>
  <registerRecords>AccumulationRegister.РеестрПриобретенныхМатериальныхРесурсов</registerRecords>
  <registerRecords>InformationRegister.ВыполненныеРаботы</registerRecords>
  <registerRecords>InformationRegister.ТарифыКомандировочных</registerRecords>
  <registerRecords>InformationRegister.НалоговаяВыверка</registerRecords>
  <registerRecords>InformationRegister.СведенияОТранспорте</registerRecords>
  <registerRecords>InformationRegister.ПлановыеНачисленияОкончание</registerRecords>
  <registerRecords>InformationRegister.СостояниеЗаказов</registerRecords>
  <registerRecords>AccumulationRegister.НДСНаИмпорт</registerRecords>
  <registerRecords>InformationRegister.СведенияПоНалогуНаИмущество</registerRecords>
  <registerRecords>AccumulationRegister.Продажи</registerRecords>
  <registerRecords>AccumulationRegister.НДСГТДИмпорт</registerRecords>
  <registerRecords>InformationRegister.СведенияПоПоказателямИмпорта</registerRecords>
  <registerRecords>AccumulationRegister.ВыпускПродукцииУслуг</registerRecords>
  <registerRecords>InformationRegister.ПараметрыУчетаОС</registerRecords>
  <registerRecords>AccumulationRegister.ПоступлениеТоваров</registerRecords>
  <registerRecords>InformationRegister.ЗаказаннаяПродукция</registerRecords>
  <registerRecords>InformationRegister.СведенияОВвозимыхТоварах</registerRecords>
  <registerRecords>InformationRegister.Профсоюз</registerRecords>
  <registerRecords>InformationRegister.НалоговаяАмортизация</registerRecords>
  <registerRecords>CalculationRegister.Удержания</registerRecords>
  <registerRecords>InformationRegister.СостоянияОС</registerRecords>
  <registerRecords>AccumulationRegister.ВозвратыТоваров</registerRecords>
  <registerRecords>InformationRegister.ТабельПоЧасам</registerRecords>
  <registerRecords>AccumulationRegister.НалогиПоЗаработнойПлате</registerRecords>
  <registerRecords>InformationRegister.СобытияОС</registerRecords>
  <registerRecords>AccumulationRegister.ЗемельныйНалог</registerRecords>
  <registerRecords>InformationRegister.ПлановыеУдержанияНачало</registerRecords>
  <registerRecords>InformationRegister.СведенияОПоступлении</registerRecords>
  <registerRecords>InformationRegister.ПлановыеНачисленияНачало</registerRecords>
  <registerRecords>AccumulationRegister.ДанныеРеестраГТД</registerRecords>
  <registerRecords>InformationRegister.СтатусыСотрудников</registerRecords>
  <registerRecords>AccumulationRegister.ПодоходныйНалог</registerRecords>
  <registerRecords>AccumulationRegister.СоциальныйФонд</registerRecords>
  <registerRecords>InformationRegister.СчетаФактурыПолученные</registerRecords>
  <registerRecords>AccumulationRegister.ВыплаченнаяЗарплата</registerRecords>
  <registerRecords>InformationRegister.ПлановыеУдержанияОкончание</registerRecords>
  <registerRecords>AccumulationRegister.АвансыДоотгрузка</registerRecords>
  <registerRecords>AccumulationRegister.КорректировкиНУ</registerRecords>
  <registerRecords>InformationRegister.ПлатежиПоНалогуНаПрибыль</registerRecords>
  <registerRecords>InformationRegister.СведенияОНДСНаИмпорт</registerRecords>
  <registerRecords>InformationRegister.СведенияОбЭСФ</registerRecords>
  <registerRecords>InformationRegister.СоставОС</registerRecords>
  <registerRecords>CalculationRegister.Начисления</registerRecords>
  <registerRecords>InformationRegister.Сотрудники</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.ПараметрыУчетаКомплектовОС</registerRecords>
  <registerRecords>AccumulationRegister.ВыработкаОС</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаОперации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособЗаполнения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СторнируемыйДокумент</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТиповаяОперация</name>
    <type>
      <types>CatalogRef.ТиповыеОперации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаРегистровСведений</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТаблицаРегистровНакопления</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БПКР/src/Documents/ОперацияБух/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Устанавливает/снимает признак активности движений документа в зависимости от пометки удаления.
// Следует вызывать перед записью измененной пометки удаления.
// Помеченный на удаление документ не должен иметь активных движений.
// Не помеченный на удаление документ может иметь неактивные движения.
Процедура СинхронизироватьАктивностьДвиженийСПометкойУдаления()
	
	Если НЕ ПометкаУдаления Тогда
		// Не помеченный на удаление документ может иметь неактивные движения.
		// Однако, при снятии пометки удаления все движения становятся активными.
		Если ЭтоНовый() Или ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "ПометкаУдаления") = ПометкаУдаления Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	// Данные движений будут читаться только при неинтерактивной работе (например, при пометке на удаление документа
	// из списка). Поэтому чтение без контроля прав будет безопасным.
	УстановитьПривилегированныйРежим(Истина);
	РегистрыСДвижениями = Новый Массив;
	Для Каждого Движение Из Движения Цикл
		
		Если Движение.Записывать = Ложь Тогда // При работе формы набор может быть уже "потроган" (прочитан, модифицирован)
			// Набор никто не трогал
			Движение.Прочитать();
		КонецЕсли;
		
		Если Движение.Количество() > 0 Тогда
			РегистрыСДвижениями.Добавить(Движение);
		КонецЕсли;
		
	КонецЦикла;
	УстановитьПривилегированныйРежим(Ложь);
	
	Активность = НЕ ПометкаУдаления;
	Для Каждого Движение Из РегистрыСДвижениями Цикл
		
		Для Каждого Строка Из Движение Цикл
			
			Если Строка.Активность = Активность Тогда
				Продолжить;
			КонецЕсли;
			
			Строка.Активность   = Активность;
			Движение.Записывать = Истина; // На случай, если набор был прочитан выше
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

#Область ОбработчикиСобытий

Процедура ПриКопировании(ОбъектКопирования)

	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
	Ответственный = Пользователи.ТекущийПользователь();
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнениеОбъектовБП.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения);

	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ТиповыеОперации") Тогда
		СпособЗаполнения = "ТиповаяОперация";
		ТиповаяОперация	 = ДанныеЗаполнения.Ссылка;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если СпособЗаполнения = "Вручную" Тогда
		ТиповаяОперация      = Неопределено;
		СторнируемыйДокумент = Неопределено;
	ИначеЕсли СтрНайти(СпособЗаполнения, "Сторно") > 0 Тогда
		ТиповаяОперация = Неопределено;
	ИначеЕсли СпособЗаполнения = "ТиповаяОперация" Тогда
		СторнируемыйДокумент = Неопределено;
	КонецЕсли;
	
	// Заполнение даты документа и реквизитов регистров Период и Организация.
	Для каждого НаборЗаписей Из Движения Цикл
		
		Если НаборЗаписей.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ПустаяТаблица   = НаборЗаписей.ВыгрузитьКолонки();
		ЕстьОрганизация = ПустаяТаблица.Колонки.Найти("Организация") <> Неопределено;
		ЕстьПериод      = ПустаяТаблица.Колонки.Найти("Период") <> Неопределено;
		
		Если НЕ (ЕстьОрганизация ИЛИ ЕстьПериод) Тогда
			Продолжить;
		КонецЕсли;
		
		ТаблицаДвижений = НаборЗаписей.Выгрузить();
		Если ЕстьОрганизация Тогда
			ТаблицаДвижений.ЗаполнитьЗначения(Организация, "Организация");
		КонецЕсли;
		Если ЕстьПериод Тогда
			ТаблицаДвижений.ЗаполнитьЗначения(Дата, "Период");
		КонецЕсли;
		НаборЗаписей.Загрузить(ТаблицаДвижений);
		
		// Актуализируем списки регистров
		ИмяРегистра = НаборЗаписей.Метаданные().Имя;
		Если Метаданные.РегистрыНакопления.Содержит(НаборЗаписей.Метаданные()) Тогда
			ДобавитьРегистрНакопления(ИмяРегистра);
		ИначеЕсли Метаданные.РегистрыСведений.Содержит(НаборЗаписей.Метаданные()) Тогда
			ДобавитьРегистрСведений(ИмяРегистра);
		КонецЕсли;
	КонецЦикла;
	
	СинхронизироватьАктивностьДвиженийСПометкойУдаления();
	
КонецПроцедуры // ПередЗаписью()

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
	Если СтрНайти(СпособЗаполнения, "Сторно") = 0 Тогда
		МассивНепроверяемыхРеквизитов.Добавить("СторнируемыйДокумент");
	КонецЕсли;
	Если СтрНайти(СпособЗаполнения, "ТиповаяОперация") = 0 Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ТиповаяОперация");
	КонецЕсли;	
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьРегистрНакопления(ИмяРегистра)
	
	Если ТаблицаРегистровНакопления.Найти(ИмяРегистра, "Имя") = Неопределено Тогда
		ТаблицаРегистровНакопления.Добавить().Имя = ИмяРегистра;
	КонецЕсли;
	
КонецПроцедуры
		
Процедура ДобавитьРегистрСведений(ИмяРегистра)
	
	Если ТаблицаРегистровСведений.Найти(ИмяРегистра, "Имя") = Неопределено Тогда
		ТаблицаРегистровСведений.Добавить().Имя = ИмяРегистра;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
